Revit 2027 API
BuiltInFailures.RoomFailures.RoomsFailed Property
 [Room] computations only succeeded without considering the following elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomsFailed { get; }
Public Shared ReadOnly Property RoomsFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomsFailed {
	FailureDefinitionId^ get ();
}
static member RoomsFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace